app/views/projects/show.html.erb

SELECT `project_files`.* FROM `project_files` WHERE `project_files`.`project_id` = 1 LIMIT 1
---
                <% count = 0 %>
                <% @project.project_file.csv_user.split(',').each do | user_link| %>