app/controllers/customers_controller.rb

  def index
    begin
    project = Project.find(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

  def get_users
    begin
    project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 3 LIMIT 1