app/controllers/groups_controller.rb

 def index
  begin
 	  project = Project.find(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 3 LIMIT 1