app/controllers/projects_controller.rb

	def create
	 project=current_user.projects.new(params[:project])
	 if project.save
---
INSERT INTO `projects` (`consumer_key`, `consumer_secret`, `created_at`, `name`, `oauth_token`, `oauth_token_secret`, `subdomain`, `support_email`, `updated_at`, `user_id`) VALUES ('WrBYxHXDhmypXDAEPFlQ', '1uJt0Jp4yx6TmxTzQyw4JJMgLGqMBuDDiF1KCIIm', '2014-01-30 07:28:03', 'testing', 'mkErdq2kvw40JJd8DnQg', 'MT6i5ZbIW8FYOUs0IVnYdoddLAGmrvM2j8zw5AOQ', 'https://testtec.desk.com', 'test@testing.com', '2014-01-30 07:28:03', 1)

   def show
   	@project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1